tsung_scripts/tsung_login.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/opt/homebrew/Cellar/tsung/1.8.0/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="localhost" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="60" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <!--
    <arrivalphase phase="2" duration="60" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="60" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="60" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="60" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="60" unit="second">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="7" duration="60" unit="second">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase>  
    -->  
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

  </options>

  <sessions>
    <session name="user_login_signup" probability="100" type="ts_http">
      <!-- Load Login Page -->
      <request>
        <http url="/" method="GET" version="1.1"/>
      </request>

      <!-- Sign Up -->
      <request>
        <http url="/users/" method="POST" version="1.1"
              contents="user%5Bname=%5Dnewuser%tsung%&amp;user%5Bemail%5D=newuser%tsung%@example.com&amp;user%5Bpassword%5D=newpassword&amp;user%5Bpassword_confirmation%5D=newpassword&amp;commit=Sign+Up"
              content_type="application/x-www-form-urlencoded">
          <http_header name="Content-Type" value="application/x-www-form-urlencoded"/>
        </http>
      </request>

      <!-- Sign In -->
      <request>
        <http url="/users/sign_in" method="POST" version="1.1"
              contents="user%5Bemail%5D=newuser%tsung%@example.com&amp;user%5Bpassword%5D=newpassword&amp;commit=Log+In"
              content_type="application/x-www-form-urlencoded">
          <http_header name="Content-Type" value="application/x-www-form-urlencoded"/>
        </http>
      </request>
    </session>
  </sessions>
</tsung>